Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: མཽད་གལ་གྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པར་བྱ་ཞིང་། བརྩོན་འགྲུས་མི་གཏང་བར་བྱའོ། །
en: Maudgalyāyana, bodhisattvas who wish to awaken to unexcelled and perfect buddhahood must rely on a spiritual teacher and not let their diligence weaken.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། བྱང་ཆུབ་སེམས་དཔའ་འོད་འཕགས་ཞེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there was a bodhisattva by the name of Noble Light.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པ། དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་རྣམས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དགེ་བ་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: He was abiding in unexcelled and perfect awakening, had given rise to roots of virtue before innumerable buddhas, and was endowed with abundant virtues.

source: དེ་ཉལ་བའི་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་དང་ལྷན་ཅིག་ཏུ་གཏམ་ཡང་དག་པར་སྨྲ་བར་འགྱུར་བ་ལ་མ་གཏོགས་པར་གཞན་ཅི་ཡང་མི་མཐོང་སྟེ།
en: When asleep, in his dreams the bodhisattva would have actual conversations with thus-gone ones.

source: ཇི་ལྟར་འདིར་དེ་བཞིན་གཤེགས་པ་དང་ཡང་དག་པར་འགྲོགས་པ་བྱས་ཤིང་། ཡོངས་སུ་འདྲིས་པར་བྱས་སོ། །
en: Thus, while nobody else could see it, he would accompany the thus-gone ones and ask them questions.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་ཐོགས་མེད་སྟོན་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: At that time there was in the world a thus-gone one known as Unhindered Teacher.

source: དེ་དེ་བཞིན་གཤེགས་པ་ཐོགས་མེད་སྟོན་དེ་དང་ལྷན་ཅིག་བར་སྐབས་སུ་གཏམ་འདི་ལྟ་བུ་ཞིག་བྱས་སོ། །
en: Once when in the company of that thus-gone one the bodhisattva Noble Light asked him,

source: བཅོམ་ལྡན་འདས་འཇིག་རྟེན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཇི་ལྟར་ཡང་དག་པར་རྟོགས་པར་འགྱུར།
en: ‘Blessed One, how may one gain knowledge of the origin as related to knowledge of the world?

source: འཇིག་རྟེན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེའི་རྒྱུ་མཚན་ཕན་པར་འགྱུར་བ་ནི་གང་ལགས།
en: What are the beneficial causes of knowledge of the origin as related to knowledge of the world?’

source: བཀའ་སྩལ་པ་རིགས་ཀྱི་བུ་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པར་ཞུགས། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་ཡོངས་སུ་ཞུ་བར་སེམས་པ་ནི་ལེགས་སོ་ལེགས་སོ། །
en: “ ‘Noble son,’ replied the Blessed One, ‘you are asking the Thus-Gone One this question because you wish to benefit many beings and bring them happiness. That is excellent, excellent indeed.

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ། དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: Therefore, listen very well, noble son, and take to heart what I am about to say.’

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་འོད་འཕགས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “ ‘Excellent, Blessed One,’ replied the bodhisattva Noble Light, and as he the listened keenly, the Blessed One explained,

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཤེས་པ་རྟོགས་པར་བྱ་བའི་ཕྱིར། བསྟན་བཅོས་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་མངོན་པར་བརྩོན་པར་བྱ། གཞན་ཡང་འཇིག་རྟེན་གྱི་ཀུན་ཏུ་སྤྱོད་པ་ལ་བརྩོན་པར་བྱ། གཞན་ཡང་དགེ་མཚན་དང་ལྡན་པར་བྱ།
en: ‘Noble son, bodhisattvas who wish to awaken to unexcelled and perfect buddhahood must, for the sake of the attainment of knowledge, diligently pursue the comprehension of all the treatises, ardently apply themselves to the conduct of the world, and take possession of the marks of virtue.

source: འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སྤྱད་པ་སྤྱོད་པ་ན་ཕྱིས་འབྱུང་བའི་སྔོན་གྱི་རབས་གྲུབ་པའི་མཐའ་འདི་ལ་བསླབ་པར་བྱ།
en: Thus, while engaged in their activities the bodhisattvas must study all philosophical systems of former generations.

source: གཞན་ཡང་གང་ཟག་གི་ཐ་སྙད་དང་། གྲོང་དང་། ཡུལ་གྱི་ཐ་སྙད་ལ་བསླབ་པར་བྱ།
en: They must also study the conventions of people, cities, and countries.

source: གང་དང་གང་དུ་འགྲོ་བ་དེ་དང་དེའི་ཐ་སྙད་ལ་བསླབ་པར་བྱ་སྟེ། ཇི་ཙམ་དུ་གང་འཇིག་རྟེན་གྱི་ཤེས་པ་དང་། ཐམས་ཅད་དུ་ཤེས་པ་ལ་མཁས་པར་བྱའོ། །
en: Wherever they go, they must learn the relevant conventions, and so do their best to gain expert knowledge about the world, and expert knowledge about everything.’

source: དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་འོད་འཕགས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: In case you may think that at that time the bodhisattva Noble Light was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་འོད་འཕགས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva Noble Light.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔས་འཇིག་རྟེན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་བསླབ་པར་བྱའོ།། །།
en: Thus, Maudgalyāyana, bodhisattvas must train to gain knowledge of the origin as related to knowledge of the world.

source: མཽད་གལ་གྱི་བུ་གཞན་ཡང་འཇིག་རྟེན་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created a boundless number of different roots of virtue in order to understand cessation as related to the world.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན།
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there was a person called Sustaining through Form and Adhering to the Nature of All People.

source: གཟུགས་ཀྱིས་འཚོ་བ་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་ངོ་བོའི་རྗེས་སུ་འཇུག་པ་ཞེས་བྱ་བ་གཟུགས་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: That person possessed an excellent body of captivating beauty, fine complexion, and perfect developments.

source: དེ་སྐྱེས་བུ་གང་དང་གང་དུ་རྗེས་སུ་འགྲོ་བར་འགྱུར་བ་དེ་དང་། དེ་ཉིད་དུ་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: Whoever would accompany that person would obtain unfathomable roots of virtue.”

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེད་དཔོན་འབྱུང་པོ་ཀུན་ལ་བརྩེ་བ་དང་ལྡན་པ་ཞེས་བྱ་བ་ཡོ་བྱད་ཐམས་ཅད་དང་ལྡན་པ་ཞིག་བྱུང་སྟེ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there was a captain named Loving All Beings who had abundant possessions.

source: ཚོང་པ་ལྔ་བརྒྱ་དང་ལྷན་ཅིག་ཏུ་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་སོ། །
en: This captain went to sea with a group of five hundred merchants,

source: དེ་རྒྱ་མཚོའི་དབུས་སུ་ཕྱིན་པ་དང་། ཆུ་སྲིན་གྱིས་གྲུ་མིད་པར་བྱེད་དེ།
en: yet when their ship was in the middle of the ocean it was attacked by a sea monster.

source: དེའི་ཁར་གྲུ་དེ་འཇུག་གོ། །དེ་ནས་ཚོང་པ་དེ་དག་ལྷ་གང་དང་གང་ལ་དད་ཅིང་མོས་པ་དེ་དང་དེ་དག་ལ་ཕྱག་འཚལ་ཞིང་ངུ་སྟེ།
en: As the monster held the ship in its jaws the merchants paid homage and cried out to whichever gods they had faith and belief in.

source: ཁ་ཅིག་ནི་ཞི་བ་ལ། ཁ་ཅིག་ནི་སྐེམ་བྱེད་ལ། ཁ་ཅིག་ནི་དབང་ཕྱུག་ཆེན་པོ་ལ། ཁ་ཅིག་ནི་དབང་པོ་ལ། ཁ་ཅིག་ནི་ཆུ་ལྷ་ལ། ཁ་ཅིག་ནི་སྐྱེ་དགུའི་བདག་པོ་ལ། ཁ་ཅིག་ནི་ཚངས་པ་ལ། ཁ་ཅིག་ནི་བདེ་བྱེད་ལ། ཁ་ཅིག་ནི་ཉི་མ་ལ། ཁ་ཅིག་ནི་ཟླ་བ་ལ། ཁ་ཅིག་ནི་རྒྱ་མཚོ་ཆེན་པོ་དེ་ཉིད་ལ་ཕྱག་འཚལ་བར་བྱེད།
en: Thus they called out to Śiva, Skanda, Maheśvara, Indra, Varuṇa , Prajāpati, Brahmā, Kṣemaṅkara , Sūrya, or Candra.

source: ཁ་ཅིག་ནི་བདག་ཅག་ལ་མགོན་སྐྱབས་འདི་དག་མེད་པས་ཤི་ཡང་རུང་ཞེས་ཅང་མི་ཟེར་བར་འཁོད་ཀྱང་དེ་དག་གང་ཡང་སྐྱོབ་པར་མ་གྱུར་ཏོ། །
en: Some even paid homage to the ocean itself, and some again sat speechless, thinking, ‘We have no protector of that sort—let us just die!’ Regardless, nobody came to anyone’s rescue.

source: དེ་ནས་དེད་དཔོན་འབྱུང་པོ་ཀུན་ལ་བརྩེ་བ་དང་ལྡན་པ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “The captain Loving All Beings thought to himself,

source: ཀྱེ་མ་ཚོང་པ་འདི་དག་ཐམས་ཅད་ནི་སྐྱབས་ངན་པ་ལ་རྟེན་ཏོ། །
en: ‘Alas, all these merchants have relied on an inferior source of refuge.

source: མགོན་སྐྱབས་མ་ཡིན་པ་ལ་འདུ་ཤེས་སུ་གྱུར་ཏེ།
en: They have put their hopes in a being who is neither a protector nor a refuge.

source: ལོག་པར་མོས་པ་འདི་ལས་ཐམས་ཅད་ཀྱི་ངོ་བོའི་རྗེས་སུ་འཇུག་སྟེ།
en: In their mistaken devotion they perceive that things have essences.

source: བདག་ཡང་དག་པར་སྟོན་པ་ལྟ་བུར་བྱེད་ཀྱང་ངོ་བོ་ཉིད་ནི་སུ་ལ་ཡང་མི་སྟོན་ཏོ། །
en: Yet were I to teach, I would not teach any essences to anyone.’

source: མཽད་གལ་གྱི་བུ་དེ་བཞིན་དུ་འདུ་བྱེད་ཐམས་ཅད་ལ་ཇི་ལྟ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོག་ན་དེ་ལྟ་དེ་ལྟར་དངོས་པོ་མེད་པར་མཐོང་ངོ་། །
en: “Thus, Maudgalyāyana, when conditioned things are understood correctly, as they are, one does not perceive any entities.

source: འདུ་བྱེད་རྣམས་ལ་ངེས་པ་གང་ཡང་མེད་དེ།
en: There is no certainty with respect to formations.

source: གལ་ཏེ་གཙང་བར་འདོད་པའི་གཙང་བས་མཚན་མ་སྤངས་ཏེ། མི་གཙང་བའི་མཚན་མ་ལ་བརྟེན་པར་བྱའོ། །
en: If one wishes for purity one must give up the marks of purity and instead rely on the marks of impurity.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། མཚན་མ་སྤང་ཞིང་མཚན་མ་མེད་པ་ལ་བརྟེན་པར་བྱ་སྟེ། འདི་ན་ཐར་བའི་ལམ་མོ། །
en: Similarly, one must give up marks and rely on the absence of marks; that is the path of liberation.

source: མཽད་གལ་གྱི་བུ་ངས་ཁམས་དུ་མ་ལ་མོས་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་རྟག་པ་ནི་འཆིང་བ་ཡིན་ལ། མི་རྟག་པ་ནི་ཐར་པའོ། །
en: Maudgalyāyana, for the sake of knowledge with an interest in several elements I teach that permanence is bondage, and impermanence is liberation;

source: བདག་ནི་འཆིང་བ་ཡིན་ལ། བདག་མེད་པ་ནི་ཐར་པའོ། །
en: self is bondage, and absence of self is liberation;

source: མཚན་མ་ནི་འཆིང་བ་ཡིན་ལ། མཚན་མ་མེད་པ་ནི་ཐར་པའོ། །
en: and marks are bondage, and absence of marks is liberation.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འདོད་པ་དང་། སེམས་ཅན་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་ཡོངས་སུ་རྟོག་ན་གཙང་བའི་ཁ་དོག་ཏུ་སྟོན་པར་བྱེད་ལ།
en: “Maudgalyāyana, if a bodhisattva wishes to go beyond suffering, and is concerned about bringing all sentient beings beyond suffering as well, then that bodhisattva will display a pure appearance.

source: གལ་ཏེ་མི་གཙང་བར་ཡོངས་སུ་རྟོག་ན་མི་གཙང་བའི་ཁ་དོག་ཏུ་སྟོན་པར་བྱེད།
en: Yet if one conceives of impurity one will display an impure appearance.

source: གལ་ཏེ་བདེ་བར་རམ། གལ་ཏེ་སྡུག་བསྔལ་དུའམ། གལ་ཏེ་རྟག་པར་རམ། གལ་ཏེ་མི་རྟག་པར་རམ། གལ་ཏེ་བདག་ཏུའམ། གལ་ཏེ་བདག་མེད་པའམ། གལ་ཏེ་མཚན་མར་རམ། གལ་ཏེ་མཚན་མ་མེད་པར་རྟོག་ན་མཚན་མ་མེད་པའི་ཁ་དོག་ཏུ་སྟོན་པར་བྱེད་དོ། །
en: If one thinks in terms of happiness, suffering, permanence, impermanence, self, absence of self, marks, or absence of marks, one will display an appearance of the absence of marks.

source: མཽད་གལ་གྱི་བུ་དེ་ལ་གཙང་བར་རྟོག་པ་ནི་འཆིང་བ་ཡིན་ལ། མི་གཙང་བར་རྟོག་པ་ནི་ཐར་པའོ། །
en: Maudgalyāyana, conceiving of purity is bondage, thinking of impurity is liberation.

source: བདེ་བར་རྟོག་པ་ནི་འཆིང་བ་ཡིན་ལ། སྡུག་བསྔལ་བར་རྟོག་པ་ནི་ཐར་པའོ། །
en: Conceiving of happiness is bondage, thinking of suffering is liberation.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཉོན་མོངས་པར་གྱུར་ཏོ། །
en: It is in this way that affliction occurs.

source: གང་དེ་དག་བདག་གིས་ཉོན་མོངས་པ་འདི་ལས་ཐར་བར་བྱའོ་སྙམ་མོ། །
en: “The captain Loving All Beings wanted to free his companions from their distress.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་མུན་པ་ཐམས་ཅད་འཇོམས་པ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: At that time a thus-gone one known as Conqueror of All Darkness had appeared in the world.

source: དེད་དཔོན་འབྱུང་པོ་ཀུན་ལ་བརྩེ་བ་དང་ལྡན་པ་དེས་དེ་ཐོས་མ་ཐག་ཏུ་དད་པར་གྱུར་ནས། དེས་ཚོང་པ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: As soon as he had heard about him, the captain had developed faith in that Thus-Gone One and now he told the merchants,

source: ཁྱེད་ཅག་འདི་ལྟར་དད་པའི་སྐྱབས་ཀུན་ལ་སུས་ཀྱང་སྐྱབས་སུ་འགྱུར་བ་མེད་ཀྱིས་ཁྱེད་ཅག་ཚུར་ཤོག །
en: ‘Among all the saviors you believe in, there is not a single one who is a source of refuge.

source: ང་གང་ལ་སྐྱབས་སུ་ཉེ་བར་འགྲོ་བ་དེ་ལ་སྐྱབས་སུ་དེང་ཤིག །
en: So follow me! Take refuge in the one to whom I go for refuge!’

source: དེ་དག་གིས་སྨྲས་པ། ཁྱོད་གང་ལ་སྐྱབས་སུ་བཞུད།
en: “ ‘Who is that?’ the merchants wanted to know.

source: དེས་སྨྲས་པ། གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པ་མུན་པ་ཐམས་ཅད་འཇོམས་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ
en: “ ‘Friends,’ replied the captain, ‘the thus-gone Conqueror of All Darkness is in this world.

source: ང་དེ་ལ་སྐྱབས་སུ་འགྲོ་ཡིས་ཁྱེད་ཅག་ཚུར་ཤོག །
en: I take refuge in him.

source: དེ་བཞིན་གཤེགས་པ་མུན་པ་ཐམས་ཅད་འཇོམས་པ་དེ་ལ་ཕྱག་འཚོལ་ཅིག་སྐྱབས་སུ་དེང་ཤིག །
en: And you should follow suit. Pay homage and take refuge in him!

source: ཁྱེད་ཅག་ཐམས་ཅད་ཀྱི་བློ་ངེས་པར་བྱོས་ལ་དེ་བཞིན་གཤེགས་པ་མུན་པ་ཐམས་ཅད་འཇོམས་པ་དེ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་དེ་སྐད་བརྗོད་ཅིང་།
en: Make up your minds completely and say, “Homage to the thus-gone Conqueror of All Darkness!” ’

source: དེ་དག་ཐམས་ཅད་འཆི་བས་འཇིགས་སྐྲག་པས་མོས་པ་མཆོག་བསྐྱེད་ནས་
en: “Stricken by terror in the face of death, the merchants became entirely focused and cried,

source: དེ་བཞིན་གཤེགས་པ་མུན་པ་ཐམས་ཅད་འཇོམས་པ་དེ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་དེ་སྐད་བརྗོད་དོ། །
en: ‘Homage to the thus-gone Conqueror of All Darkness!’

source: ཆུ་སྲིན་དེས་སངས་རྒྱས་ཀྱི་སྒྲ་ཐོས་ནས་རྣ་བར་སྙན་པར་གྱུར་ཏེ། དེའི་ཁ་བཙུམས་པ་དང་། དེ་ནས་ཚོང་པ་དེ་དག་ཐམས་ཅད་ཉོན་མོངས་པ་དེ་ལས་ཐར་ཏོ། །
en: As soon as the sea monster heard the name of the Buddha it was pleased, and so it closed its mouth and let all the merchants escape from their agony.

source: དེའི་ཚེ་དེའི་དུས་ན་དེད་དཔོན་འབྱུང་པོ་ཀུན་ལ་བརྩེ་བ་དང་ལྡན་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: In case you may think that, at that time, the captain Loving All Beings was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དེད་དཔོན་འབྱུང་པོ་ཀུན་ལ་བརྩེ་བ་དང་ལྡན་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Because in those days I was the captain Loving All Beings.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་མོས་པ་དུ་མ་ཤེས་པ་མངོན་པར་རྫོགས་པ་ཤེས་པར་འདོད་པས་དངོས་པོར་འཛིན་པ་བསལ་བར་བརྩོན་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, the bodhisattva who wishes to perfectly comprehend the several inclinations must endeavor to dispel any grasping at entity.

source: མཽད་གལ་གྱི་བུ་ངས་མོས་པ་དུ་མ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the origin as related to knowledge of several inclinations.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་གྱི་གཉེན་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there appeared in the world a thus-gone one named Friend of Beings.

source: དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་གྱི་གཉེན་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་བརྩོན་ཞེས་བྱ་བ་བརྩོན་འགྲུས་བརྩམས་པ། སེམས་ཞུམ་པ་མེད་པ། གོ་ཆ་ཆེན་པོ་བགོས་པ། སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་པར་སྨོན་ལམ་ཡོངས་སུ་དག་པ་དང་ལྡན་པ།
en: Within the buddha realm of the thus-gone Friend of Beings was a bodhisattva known as Nityodyukta. Rousing diligence, this bodhisattva’s mind was undaunted, he had donned the great armor, and had pure aspirations for innumerable buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ། གཞལ་དུ་མེད། བརྗོད་དུ་མེད་པར་སྨོན་ལམ་ཡོངས་སུ་དག་པ་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: He had pure aspirations for inconceivable, incomparable, immeasurable, and inexpressible buddha realms.

source: སེམས་ཅན་དག་མོས་པ་སྣ་ཚོགས་དང་མོས་པ་དུ་མ་ཤེས་པའི་རྒྱུ་ནི་གང་རྐྱེན་ནི་གང་།
en: ‘What are the causes and conditions for knowing the distinct and numerous inclinations of sentient beings?

source: སེམས་ཅན་དག་མོས་པ་སྣ་ཚོགས་གང་དང་ལྡན་སྙམ་མོ། །
en: What are the various inclinations of sentient beings?’

source: སེམས་ཅན་དག་ཡུལ་གང་དང་གང་ལ་མང་དུ་བསྟེན་པ་དེ་ཉིད་ལ་མོས་ཤིང་དེ་ཉིད་ལ་དགའ་སྟེ།
en: ‘Sentient beings are concerned about, and take delight in, whichever objects they rely on the most.

source: དེ་དང་དེ་ཉིད་ཀྱིས་མངོན་པར་དགའ། དེ་ལ་གཞོལ་བར་འགྱུར།
en: Those are the objects they are fond of and pursue.

source: དེ་ལ་འབབ་དེ་ལ་བབ་སྟེ་ཡུལ་གཞན་ལ་ཡང་མི་འཐུན་པར་འགྱུར་རོ། །
en: They concentrate on those objects to the extent that they will be adverse to others.

source: དེ་ནས་དེ་ཡུལ་དེ་མ་དམིགས་པ་ན་ཡང་གཞན་གང་ལ་གོམས་པ་ཡོད་ནས། དེ་ལ་ཡང་དེ་ཉིད་ཡིན་པར་འཛིན་ཏེ་དེ་ལ་མོས་པར་ཡང་འགྱུར་རོ། །
en: However, if that object disappears from their experience, they instead become accustomed to another, which will then replace the former object as their object of concern.

source: ཡུལ་གཞན་དང་གཞན་དུ་འགྱུར་ན་ཡང་དེའི་མོས་པ་ལྡོག་པར་འགྱུར་ཏེ། དེ་ཡོན་ཏན་དུ་མཐོང་ངོ་། །
en: And so the process continues, as the inclinations shift from one type of object to another.

source: ཡོན་ཏན་དུ་འཛིན་པ་ལས་སེམས་ཅན་དག་དེར་གཞོལ་བར་འགྱུར་ལ། སྐྱོན་དུ་འཛིན་པ་ལས་ཞེ་འགྲས་པར་འགྱུར་རོ། །
en: Sentient beings will thus pursue whichever object they currently find rewarding and they will be hostile toward whichever object they deem flawed.

source: དེ་ལྟ་བས་ན་ཡུལ་གྱི་ཡོན་ཏན་དེ་ལ་སེམས་གཞོལ་བར་མི་བྱ། སྐྱོན་དུ་འཛིན་པ་ལ་ཞེ་སྡང་བར་མི་བྱ།
en: One should therefore not become obsessed with the qualities of any object, nor should one develop aggression toward any object one may hold to be flawed.

source: ཡུལ་རྣམས་ལ་སོ་སོར་བརྟགས་པས་བཏང་སྙོམས་སུ་བྱའོ། །
en: Instead, one should discern the objects and then remain neutral.’

source: བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་བརྩོན་པ་ནི་ཡུལ་གྱི་ཡོན་ཏན་ལ་ཡང་རྗེས་སུ་ཆགས་པ་མེད། སྐྱོན་ལ་ཡང་ཞེ་འགྲས་པ་མེད་དེ།
en: In this way the bodhisattva Nityodyukta would neither crave for desirable objects nor be averse to faulty ones.

source: སོ་སོར་བརྟགས་པས་བཏང་སྙོམས་སུ་བྱེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: Instead he would discern objects and remain neutral. In doing so, his achievement of the qualities of the bodhisattvas became irreversible.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན། བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་བརྩོན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the bodhisattva Nityodyukta was anyone else, do not think so.

source: དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་དེ་དེའི་ཚེ་དེའི་དུས་ན། བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་བརྩོན་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Because in those days the thus-gone Dīpaṃkara was the bodhisattva Nityodyukta.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ཡུལ་ཐམས་ཅད་ལ་མོས་པ་རྣམ་པར་སྤང་ཞིང་། མྱ་ངན་ལས་འདས་པ་ལ་མོས་པར་བྱ་སྟེ།
en: Therefore, Maudgalyāyana, bodhisattvas should give up concern for all objects and instead be concerned with the transcendence of suffering.

source: མོས་པ་འདི་ནི་མཆོག་ཡིན་ནོ། །
en: That is the supreme concern.

source: མཽད་གལ་གྱི་བུ་ངས་མོས་པ་དུ་མ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand cessation as related to knowledge of several inclinations.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་རིན་པོ་ཆེའི་དཔལ་ཀུན་ལས་འཕགས་པ་ཞེས་བྱ་བ་སེམས་ཅན་ལམ་གོལ་བ་ལ་རབ་ཏུ་ཞུགས་པ་རྣམས་ལ་ལམ་ཡང་དག་པར་སྟོན་པ་ཞིག་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there appeared in the world a sage by the name of Unequaled Jewel Splendor, who taught the true path to those who were on mistaken paths.

source: དེ་སེམས་ཅན་མོས་པ་དུ་མ་དང་། མོས་པ་དུ་མ་ལ་མངོན་པར་ཞེན་པ་རྣམས་ཀྱི་སྐྱོན་བསྟན་པའི་ཕྱིར་མོས་པ་དུ་མ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །
en: In order to show the flaws of being attached to several inclinations he taught the knowledge of cessation as related to knowledge of several inclinations.

source: མོས་པ་དང་འགོག་པའི་ཆོས་དེ་དག་ཐམས་ཅད་དང་། རང་གི་མོས་པ་ལ་ལྷག་པར་ཆགས་པ་བསྐྱེད་པར་མི་བྱ་སྟེ། མོས་པ་དེ་དག་ཐམས་ཅད་ནི་སླུ་བ་ཡིན་ནོ། །
en: Thus, he would explain, ‘All the inclinations, the qualities of cessation, and your own inclinations should not become the cause of obsession, because all of these inclinations are deceptive.

source: ཁྱེད་ཅག་གི་མོས་པ་དེ་གཞན་ཡིན་ལ་ཆོས་ཀྱི་ངོ་བོ་ཡང་གཞན་ཡིན་ཏེ།
en: Your inclinations are one thing and the essence of the Dharma another.

source: ཡང་མོས་པ་དེ་དག་ལས་ལྡོག་གོ། །
en: So let go of your inclinations.’

source: དེ་རྣམ་གྲངས་དེས་སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་དག་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱའོ། །
en: Through such teaching many thousands of beings were freed from suffering.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་རིན་པོ་ཆེའི་དཔལ་ཀུན་ལས་འཕགས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, you should not think that at that time the sage Unequaled Jewel Splendor was anyone else.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་རིན་པོ་ཆེའི་དཔལ་ཀུན་ལས་འཕགས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Because in those days I was the sage Unequaled Jewel Splendor.

source: མཽད་གལ་གྱི་བུ་ངས་མངོན་པར་ཤེས་ཏེ། འདས་པའི་དུས་ན་ང་གཟུགས་ལ་མོས་ནས་བུད་མེད་གཟུགས་བལྟ་ན་སྡུག་པ་མཆོག་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་ཡོངས་སུ་བཏང་ངོ་། །
en: “Maudgalyāyana, I remember that in the past, when I was inclined toward form, I would relinquish an unfathomable number of tens of thousands of ravishingly beautiful women.

source: ཡང་ང་སྒྲ་ལ་མོས་པར་གྱུར་ནས། ང་སྒྲ་ལ་མོས་པས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་རོལ་མོའི་སྒྲ་རྣམ་པ་སྣ་ཚོགས་དག་གིས་མཆོད་པ་བྱས་ཀྱང་དེས་ང་ཡོངས་སུ་མ་མགུའོ། །
en: Likewise, when I was inclined toward sounds, I would present all sorts of musical offerings to the memorials of the thus-gone ones, and still that was not enough for me.

source: ཡང་ང་དྲི་ལ་མོས་པར་གྱུར་ནས། ང་དྲི་ལ་མོས་པས་དྲི་མང་པོ་དག་ཡོངས་སུ་གཏད་པར་བྱས་ཀྱང་དེས་ང་ཡོངས་སུ་མ་མགུའོ། །
en: When I was inclined toward scents, I would produce abundant fragrances, and still that was not enough for me.

source: ཡང་ང་རོ་ལ་མོས་པར་གྱུར་ནས་ང་རོ་ལ་མོས་པས་འབྲུ་མང་པོ་སྣ་ཚོགས་དང་རོའི་བྱེ་བྲག་རྣམ་པ་སྣ་ཚོགས་དག་ཡོངས་སུ་བཏང་ཡང་དེས་ང་ཡོངས་སུ་མ་མགུའོ། །
en: When I was inclined toward taste, I would produce many different grains and a wide variety of dishes, and still that was not enough for me.

source: ཡང་ང་རེག་བྱ་ལ་མོས་པར་གྱུར་ནས། ང་རེག་བྱ་ལ་མོས་པས་གོས་འཇམ་པོ་སྣ་ཚོགས་དག་ཡོངས་སུ་བཏང་ཡང་དེས་ང་ཡོངས་སུ་མ་མགུའོ། །
en: When I was inclined toward texture, I would receive a wide array of soft garments, and still that was not enough for me.

source: མཽད་གལ་གྱི་བུ་ང་ཆོས་ལ་མོས་ནས་ཤེས་པ་རྣམ་པ་སྣ་ཚོགས་དག་བསླབས་ཀྱང་དེ་དག་གིས་ང་ཡོངས་སུ་མ་མགུའོ། །
en: Maudgalyāyana, when I was inclined toward mental phenomena, I trained in various forms of knowledge, and still that was not enough for me.

source: མཽད་གལ་གྱི་བུ་གང་མྱ་ངན་ལས་འདས་པ་ལ་མོས་པ་དེ་ནི། མོས་པ་དེ་ལས་ཡོངས་སུ་ཉམས་པ་མེད་དོ། །
en: Maudgalyāyana, those who are inclined toward the transcendence of suffering will never waver in their dedication.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མོས་པ་དུ་མ་ཤེས་པ་ལ་བསླབ་པར་བྱ་སྟེ། མོས་པ་ཐམས་ཅད་ཀྱང་འགོག་པའི་ཆོས་ཅན་དུ་བལྟའོ། །
en: Thus, Maudgalyāyana, bodhisattva great beings must train to acquire knowledge of several inclinations, and yet all inclinations should be understood to be subject to cessation.

source: མཽད་གལ་གྱི་བུ་ངས་མོས་པ་དུ་མ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, I have created numerous different roots of virtue in order to understand the path that leads to cessation as related to knowledge of several inclinations.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། །དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབེབས་པ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there appeared in the world a thus-gone one named Rainfall from the Clouds of Dharma.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་ཚོགས་དཔག་ཏུ་མེད་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ཏོ། །
en: This Thus-Gone One was surrounded by an unfathomable retinue of members of the vehicle of hearers, members of the vehicle of solitary buddhas, and members of the vehicle of bodhisattvas.
